import client from './client';
import { AmatuerResultParams } from '../models/amatuer';

const dummyData = {
  store: {
    total: 12312313, // 해당 동 전체 점포 수 (2021.4분기)
    yearAgo: 3213151, // 해당 동 전년 전체 점포 수 (2020.4분기)
    gender: [43.6, 56.4], // 해당 동 업종별 고객 성비(2021.4분기)
    age: [
      // 해당동 업종 대분류별 고객 연령대 비율(최신) !!!여기부터 store 부분 지금 완벽하지 않음
      11, // 10대 배열로 하삼!!!!
      22.2,
      33,
      44.5,
      55,
      66.7, // 60대 이상
    ],
  },
  sales: {
    // 분기 매출을 기준으로 해주세요 (여긴 비율아님/ 1년 평균)
    total: 15264897, // 해당 동 총 분기 매출 (5년 추이)
    areaTop3: {
      // 해당 동 매출이 높은 상권 top3
      top1: '상권1',
      top2: '상권2',
      top3: '상권3',
    },
    week:
      // 해당 동 분기별, 요일별 매출액 (비율 아님, 매출액)
      [
        12, // 월
        16,
        21,
        14,
        21,
        32,
        54,
      ], // 일
    time: {
      // 해당 동 분기별, 시간별 매출액
      time1: 132, // 시간대1
      time2: 456,
      time3: 489,
      time4: 213,
      time5: 145,
      time6: 123,
    },
    age: [
      // 해당 동 분기별, 연령대별 매출액
      14, // 10대
      266,
      14,
      123,
      89,
      32,
    ], // 60대 이상
    gender: [
      // 해당 동 분기별 성별 매출
      15165, // 해당 동 분기별 남성 매출
      465469,
    ], // 해당 동 분기별 여성 매출
  },
  living: {
    // 동별 분기별 유동인구로 해주세요 (연평균)
    total: 13215615165145, // 해당 동 분기별 총 유동인구 5년춫ㅇ
    week: [], // 해당 동 분기별 요일별 유동인구
    time: [], // 해당 동 분기별 시간대별 유동인구
    age: [], // 해당 동 분기별 연령대별 유동인구
    gender: [], // 해당 동 분기별 성별 유동인구
    areaTop3: [], // 해당 동 분기별 유동인구 top3 상권
  },
  resident: {
    // 해당 동 분기별 거주인구
    total: [151561561, 151561561, 151561561, 151561561, 151561561], // 해당 동 거주인구 (5년 추이, 5개)
    age: [
      // 연령 최신 분기 기준
      123115, 15156165, 123151, 151615, 1561561, 15615312,
    ],
    gender: [
      156151, // 해당 동 분기별 남성 거주인구
      156151, // 해당 동 분기별 여성 거주인구
    ],
    house: 2501346, // 동별 총 가구 수
  },
  hinterland: {
    //(최신분기)
    living: 165156534, // 배후지 총 유동(생활)인구
    work: 46165615, // 배후지 총 직장인구

    resident: 125165161, // 배후지 총 거주인구
    gender: [
      // 배후지 성별 거주인구
      51615, // 남
      516515,
    ], // 녀
    age: [
      // 배후지 연령대별 거주인구
      1561, // 10대
      1231,
      1275,
      3654,
      4561,
      3215, // 60대 이상
    ],
  },
  open: {
    //8분기 8개
    total: 21, // 해당 동 점포 개업 수
    rate: 10.1, // 해당 동 점포 개업율
  },
  close: {
    total: 10, // 해당 동 점포 폐업 수
    rate: 2.5, // 해당 동 점포 폐업율
  },
  income: 21564651, // 해당 동 월평균 소득 금액
  consumption: {
    // 모든 값은 분기 기준으로 해주세요 (연평균)
    total: 5.2e8, // 해당 동 지출 총 금액
    grocery: 1.29e8, // 해당 동 식료품 지출 총 금액
    clothing: 64853632, // 해당 동 의류, 신발 지출 총 금액
    house: 37122367, // 해당 동 생활용품 지출 총 금액
    medical: 37122367, // 해당 동 의료비 지출 총 금액
    traffic: 37122367, // 해당 동 교통 지출 총 금액
    leisure: 22223650, // 해당 동 여가 지출 총 금액
    culture: 14656697, // 해당 동 문화 지출 총 금액
    education: 76185341, // 해당 동 교육 지출 총 금액
    pleasure: 21941557, // 해당 동 유흥 지출 총 금액
  },
};

export const amatuerResult = async (params: AmatuerResultParams) => dummyData;
